#09: Membagi Data Frame menjadi dua secara acak

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  12  11   3   7  11
1  18  15   5  15   8
2   4  14  11  16   6
3   2   1  16   3   9
4   3  12   3  14   2
5   4   1   1  10   7
6  11   6  18  16   9
7  18   1   2  14  18
8   8  13  19  17  14
9  13   6  15  13  18

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
df_1

    A   B   C   D   E
9  13   6  15  13  18
4   3  12   3  14   2
8   8  13  19  17  14
7  18   1   2  14  18
6  11   6  18  16   9
1  18  15   5  15   8
3   2   1  16   3   9

In [6]:
df_2

    A   B   C   D   E
0  12  11   3   7  11
2   4  14  11  16   6
5   4   1   1  10   7

#10: Mengganti nama (label) kolom pada Data Frame berdasarkan pola

In [2]:
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0.0,0.0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1.0,2.0,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1.0,2.0,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1.0,2.0,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1.0,2.0,113781,151.5500,C22 C26,S

In [16]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

    a   b   c   d   e
0  12  11   3   7  11
1  18  15   5  15   8
2   4  14  11  16   6
3   2   1  16   3   9
4   3  12   3  14   2

In [3]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0.0,0.0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1.0,2.0,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1.0,2.0,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1.0,2.0,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1.0,2.0,113781,151.5500,C22 C26,S

#11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc

In [18]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [19]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  14   1  12  10  15
1  10  12   8  18   8
2   9   9  15   9  19
3  10  12   2  10   2
4   3   4   9   9  12
5  15   9  19  11  18
6  16   2  11   7   6
7  15   6   5   3   1
8  10  15  16  12  12
9   8   7   3  19   1

In [20]:
df.loc[[0,3,4], ['B','E']]

    B   E
0   1  15
3  12   2
4   4  12

In [21]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
1  12  18   8
3  12  10   2
8  15  12  12

In [22]:
df.loc[0:4, 'B':'D']

    B   C   D
0   1  12  10
1  12   8  18
2   9  15   9
3  12   2  10
4   4   9   9


#12: Membentuk kolom bertipe datetime dari sejumlah kolom lain pada Data Frame

In [23]:
import pandas as pd

print(pd.__version__)

2.3.3

In [24]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [25]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [4]:
df.dtypes

pclass               int64
survival_status      int64
full_name           object
sex                 object
age                float64
sib_sp             float64
parch              float64
ticket              object
fare               float64
cabin               object
embarked            object
dtype: object